Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisAreas Property
 The analysis areas of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisArea> AnalysisAreas { get; }
Public ReadOnly Property AnalysisAreas As List(Of AnalysisArea)
	Get
Property Value
Type: List<AnalysisArea>
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace